content/post/2022-02-20-debian-packaging-for-fedorans/index.org
#+HUGO_BASE_DIR: ~/code/personalBlogdown
#+HUGO_SECTION: .

#+HUGO_WEIGHT: 2001
#+HUGO_AUTO_SET_LASTMOD: t

#+TITLE: Debian Packaging for Fedorans

#+DATE: 2020-02-21
#+HUGO_TAGS: Debian Fedora Packaging
#+HUGO_CATEGORIES: Linux
#+HUGO_MENU: :main "main" :weight 2001

#+HUGO_DRAFT: false

* Preamble
  :PROPERTIES:
  :CUSTOM_ID: preamble
  :END:
I'm the package maintainer for [[https://www.messerlab.org/slim][SLiM:
Selection on Linked Mutations]] on Fedora-based, Debian-based,
SUSE-based Linux distributions. I created and have maintained the RPM
package (which targets the Fedora-family and openSUSE) for more than a
year now, and I have also created and maintained the shell script which
builds and installs SLiM for Debian-based platforms. The script is a
little rigid, and it doesn't have any safety included: it will overwrite
binaries from the defunct SLiM login manager (which I'm okay with, but
some particular might not be).

* Packaging Utility-software
  :PROPERTIES:
  :CUSTOM_ID: packaging-utility-software
  :END:
There is a lot of software that is necessary to package other software.
You'll need the essentials, literally =build-essentials= on Debian, and
other packages to get started. Configure the utility software as well,
as there are few defaults when it comes to packaging in Debian. The next
is obtaining sources, and creating the Debian source control: the set of
sources that you'll create which /control/ the building of the upstream
sources into a Debian package.

It's not alike =rpmbuild= and a .spec file, with the utility software
associated with applying patches. Debian packaging is a monstrous beast
that invokes a number of helpers, wrappers, and other utilities that are
unique to workflows, eras in Debian Developer preferences, and the
Debian Policy Manual. RPM packaging isn't simple either, there is a lot
of policy and it is thankfully well-written and expository, but the
Debian documentation can be a bit opaque and there isn't an exhaustive
manual about packaging itself: the documentation seems to assume that
you're attending DebConf or a user-group meeting and have the manual at
hand and a Debian Developer within earshot to answer questions when a
confusion arises. One of the documents is literally a set of slides that
is provided without an accompanying talk. One of the slides is "let's do
an example" where a user-group would then work on an example, have
questions answered, confusion evaporated, and then move on to the next
topic. That's not available to you if you're learning online by
yourself.

Enough about that.

* Fedora
  :PROPERTIES:
  :CUSTOM_ID: fedora
  :END:
Fedora includes a lot of software. We don't pride ourselves on the
number of packages we include, but we've still got a lot. That includes
the =apt= package. APT on Fedora?
[[https://docs.fedoraproject.org/en-US/quick-docs/dnf-vs-apt/#_why_is_apt_in_the_fedora_repositories][Why
is APT in the Fedora repositories?]] Fedora users would like to package
software for Debian users!

- APT is required for =pbuilder=, which is like =rpmbuild=: it creates a
  chroot and builds the software in isolation from the workstation
  environment.

