content/post/2022-02-20-debian-packaging-for-fedorans/index.org
** Configuring APT
   :PROPERTIES:
   :CUSTOM_ID: configuring-apt
   :END:
APT will reference =/etc/apt/trusted.gpg.d=, but this is not easily
configured in Fedora 35 still. The APT package in Fedora should suggest
the =debian-keyring= package and use that to configure the sources,
taking (by default) from Sid. Fedora is fast. Debian is slow. We'll use
the unstable sources, because if you're packaging for Debian, on Fedora,
you should be targeting the next Debian release anyways.

#+begin_example
  [brycecarson@fedora 2022-02-20-debian-packaging-for-fedorans]$ sudo apt update
  Get:1 http://deb.debian.org/debian buster InRelease [122 kB]
  Err:1 http://deb.debian.org/debian buster InRelease
    The following signatures couldn't be verified because the public key is not available: NO_PUBKEY 648ACFD622F3D138 NO_PUBKEY 0E98404D386FA1D9 NO_PUBKEY DCC9EFBF77E11517
  Reading package lists... Done
  W: GPG error: http://deb.debian.org/debian buster InRelease: The following signatures couldn't be verified because the public key is not available: NO_PUBKEY 648ACFD622F3D138 NO_PUBKEY 0E98404D386FA1D9 NO_PUBKEY DCC9EFBF77E11517
  E: The repository 'http://deb.debian.org/debian buster InRelease' is not signed.
  N: Updating from such a repository can't be done securely, and is therefore disabled by default.
  N: See apt-secure(8) manpage for repository creation and user configuration details.
#+end_example

=pbuilder= won't function correctly without being able to download
packages from Debian or Ubuntu for the chroot, so we need therefore a
proper configuration.

I'll use an Ubuntu-specific jammySources.list because I had significant
trouble with Debian sources and their GPG signatures. The difficulty I
had with Debian GPG signatures is the main reason I'm writing this: to
help other Fedorans package for Debian without needing a virtual machine
(if you're already using =pbuilder= you may as well have a chroot on
your workstation instead!).

#+begin_html
  <!-- jammySources.list : switch.ca is in Edmonton with 4 Gbps connection. -->
#+end_html

#+begin_example
  deb https://mirrors.switch.ca/ubuntu/ jammy main 
  # Re-compiling Ubuntu software is not what we're doing, we only need a cache of
  # binary packages for the chroot to work with, and only if it is a chroot of
  # Jammy. APT just needs _something_ to work with or it will complain. Leave the
  # deb-src disabled, we don't need to query it which will slow things down.
  # deb-src https://mirrors.switch.ca/ubuntu/ jammy main 
#+end_example

I deleted the default .list from my /etc/apt/ because the mirror will be
slower than the one close to me (which as a relatively fast connection;
the closest is not /always/ the fastest, but a fast and close mirror
will be generally faster than the furthest and fastest mirror you could
choose).

I also deleted all the trusted keys in =/etc/apt/trusted.gpg.d= because
I was having problems with them anyways!

#+begin_example
  [brycecarson@fedora 2022-02-20-debian-packaging-for-fedorans]$ sudo apt update
  Get:1 https://mirrors.switch.ca/ubuntu jammy InRelease [270 kB]
  Err:1 https://mirrors.switch.ca/ubuntu jammy InRelease
    The following signatures couldn't be verified because the public key is not available: NO_PUBKEY 871920D1991BC93C
  Reading package lists... Done
  W: GPG error: https://mirrors.switch.ca/ubuntu jammy InRelease: The following signatures couldn't be verified because the public key is not available: NO_PUBKEY 871920D1991BC93C
  E: The repository 'https://mirrors.switch.ca/ubuntu jammy InRelease' is not signed.
  N: Updating from such a repository can't be done securely, and is therefore disabled by default.
  N: See apt-secure(8) manpage for repository creation and user configuration details.
#+end_example

The GPG error is what I struggled with for an hour earlier today.
Following every guide I could and reading manual pages did not help.
Obviously Stack Overflow didn't help either. Fedora doesn't have
documentation here either, because as
[[https://docs.fedoraproject.org/en-US/quick-docs/dnf-vs-apt/#_why_is_apt_in_the_fedora_repositories][Why
is APT in the Fedora repositories?]] explains, =apt= was actually
APT-RPM, which is unmaintained, buggy, etc. and was dropped from Fedora
and now we actually include the real APT for packagers in the Fedora
repositories since Fedora 32.

If we begin reading the Debian SecureApt documentation
[[https://wiki.debian.org/SecureApt#Signed_Release_files][here]], we'll
encounter this section:

#+begin_quote
  #+begin_example
    W: GPG error: http://ftp.us.debian.org testing Release: The following signatures
    couldn't be verified because the public key is not available: NO_PUBKEY 010908312D230C5F
  #+end_example
#+end_quote

That's the same error we see when we run =sudo apt update= for the first
time, and what will cause =pbuilder= to fail if we try to package some
software before all the utilities are properly configured; any Debian
Developer will know to configure their toolchain. Any... surely.

Here is something /really/ important, I think, that I didn't see
mentioned anywhere on Stack Overflow answers:

#+begin_quote
  Note that the second half of the long number is the key id of the key
  that apt doesn't know about, in this case that's 2D230C5F.
#+end_quote

The /second half/ of the long number is the key ID? That might've been
helpful when following the other guides referring to
=gpg --receive-keys [ e.g. 2D230C5F [...]]= (after reading the GPG
manual you'll know to use "the --keyserver in =dirmngr.conf= instead" of
=--keyserver name=, because that's deprecated, of course and not
mentioned in any recent guides).

--------------

Perhaps I got ahead of myself. Reading Debian documentation I went and
found the =Release.gpg= file from the mirror I'm using
([[file:switch.ca][Switch Inc.]] is hosting it) and installed that to
=/etc/apt/trusted.gpg.d/ca.switch.Release.gpg=. APT still failed with
the same error. Alright, I got a GPG key, put it in the directory, but
APT is still unhappy. What do we do?

Let's note that the
[[https://wiki.debian.org/SecureApt#How_to_find_and_add_a_key][SecureApt
documentation]] from Debian was last modified in 2022-01, but that
modification only changed the wording in the introduction. The previous
edit was two years prior, in 2020-11. This means the official
documentation hasn't been updated to reflect the deprecation of
=apt-key=.

#+begin_example
  man apt-key
#+end_example

#+begin_quote
  NAME apt-key - Deprecated APT key management utility
#+end_quote

