content/post/2022-02-20-debian-packaging-for-fedorans/index.md


### Why is `apt-key` deprecated? And what do we do about? {#why-is-apt-key-deprecated-and-what-do-we-do-about}

[Askeli
answered this](https://askubuntu.com/questions/1286545/what-commands-exactly-should-replace-the-deprecated-apt-key) rhetorical question on AskUbuntu. The deprecation is
motivated by the chain of trust; just as forensic evidence has a chain
of custody, there is a chain of signatures for ultimate trust in
cryptography.

We can ultimately trust the key from our mirror to sign _all_ packages
from any repository, but that's called "cross-signing" and isn't the
most secure. We should instead modify the list file:

<div class="html">

&lt;!-- jammySources.list : switch.ca is in Edmonton with 4 Gbps connection. --&gt;

</div>

<div class="html">

&lt;!-- Proper use of the Release.gpg to solve the apt-key deprecation. --&gt;

</div>

````text
deb [signed-by=/etc/apt/trusted.gpg.d/ca.switch.Release.gpg] https://mirrors.switch.ca/ubuntu/ jammy main
# Re-compiling Ubuntu software is not what we're doing, we only need a cache of
# binary packages for the chroot to work with, and only if it is a chroot of
# Jammy. APT just needs _something_ to work with or it will complain. Leave the
# deb-src disabled, we don't need to query it which will slow things down.
# deb-src [signed-by=/etc/apt/trusted.gpg.d/ca.switch.Release.gpg] https://mirrors.switch.ca/ubuntu/ jammy main
````

For _my_ comfort-level, I'm fine keeping the GPG key in the trusted
directory since I obtained the key directly from the Switch Inc. website
myself, Switch Inc. is an officially-listed Ubuntu mirror, and I have
deleted the default keyring and have no other source lists.

I ultimately trust Switch Inc. That might be a bad idea. Oh well. I'm
not _installing_ software from them, just building scientific software
for other people in a chroot. It'd be one hell of an exploit. I'd like
to see them try.

Following Askeli's answer, I've edited the .list but I get a different
error now:

> ````text
> [brycecarson@fedora 2022-02-20-debian-packaging-for-fedorans]$ sudo apt update
> E: Invalid value set for option Signed-By regarding source https://mirrors.switch.ca/ubuntu/ jammy (not a fingerprint)
> E: The list of sources could not be read.
> ````

Let's replace the file path with the "fingerprint", the key ID (if these
two are the same thing), and try again. Nope, `991BC93C` is _not_ a
fingerprint. Just the key ID. That's... helpful?

The
[GNUPG
Manual § 4.4 Examples](https://www.gnupg.org/documentation/manuals/gnupg/GPG-Examples.html) shows us `gpg -fingerprint user_ID`, and
presumably the user_ID parameter is the same as the key ID that Debian
documentation refers to (recall "the second half of the long number"?).

`````text
gpg -fingerprint 991BC93C
`````

> [brycecarson@fedora Downloads]$ gpg --fingerprint 991BC93C pub rsa4096
> 2018-09-17 [SC] F6EC B376 2474 EDA9 D21B 7022 8719 20D1 991B C93C uid
> [ unknown] Ubuntu Archive Automatic Signing Key (2018)
> [ftpmaster@ubuntu.com](mailto:ftpmaster@ubuntu.com)

Alright... it is pretty-printed so we need to see how to type this in
the jammySources.list file we created earlier. This
[old, http:// webpage](http://irtfweb.ifa.hawaii.edu/~lockhart/gpg/)
from a Hawaiian educational server says:

> To generate a short list of numbers that you can use via an
> alternative method to verify a public key, use:
> `gpg --fingerprint > fingerprint` This creates the file fingerprint
> with your fingerprint info.

Alright, a fingerprint **_file_**! Great. Creating a .fingerprint file and
changing the extension in the signed-by parameter in the list does _not_
fix the issue. Fun!

It's important to note that removing the [signed-by=/path/to/key.gpg]
from the list and importing the public key with

`````text
gpg --receive-key 991BC93C | sudo apt-key add -
`````

does not work either. The same error concerning "The following
signatures couldn't be verified because the public key is not available:
NO_PUBKEY 871920D1991BC93C" is given.


### Whatever are we to do? {#whatever-are-we-to-do}

We somewhat give up, and we use the deprecated method after re-reading
the Debian documentation and find that we're a half-idiot and were using
the wrong command when piping to `apt-key`:

`````text
[brycecarson@fedora ~]$ gpg --keyserver keyserver.ubuntu.com --receive-keys 991BC93C
gpg: key 871920D1991BC93C: "Ubuntu Archive Automatic Signing Key (2018) <ftpmaster@ubuntu.com>" not changed
gpg: Total number processed: 1
gpg:              unchanged: 1


[brycecarson@fedora ~]$ gpg -a --export 991BC93C | sudo apt-key add -
Warning: apt-key is deprecated. Manage keyring files in trusted.gpg.d instead (see apt-key(8)).
OK
W: The key(s) in the keyring /etc/apt/trusted.gpg.d/ca.switch.Release.gpg are ignored as the file has an unsupported filetype.


[brycecarson@fedora ~]$ sudo apt update
Get:1 https://mirrors.switch.ca/ubuntu jammy InRelease [270 kB]
Get:2 https://mirrors.switch.ca/ubuntu jammy/main amd64 Packages [1,407 kB]
Get:3 https://mirrors.switch.ca/ubuntu jammy/main Translation-en [514 kB]
Fetched 1,922 kB in 2s (866 kB/s)
Reading package lists... Done
Building dependency tree... Done
All packages are up to date.
W: https://mirrors.switch.ca/ubuntu/dists/jammy/InRelease: The key(s) in the keyring /etc/apt/trusted.gpg.d/ca.switch.Release.gpg are ignored as the file has an unsupported filetype.
`````

Okay! We've _finally_ managed to get APT to update its cache, and now we
should be able to use `pbuilder` on Fedora, right?


## Right? {#right}

No. Nothing has changed. We cry.

`````text
[brycecarson@fedora ~]$ sudo pbuilder create --debootstrapopts "--keyring=/usr/share/keyrings/debian-archive-keyring.gpg" --distribution jammy --architecture amd64 --mirror "deb https://mirrors.switch.ca/ubuntu jammy main"
[sudo] password for brycecarson:
dpkg-query: no packages found matching systemd
W: cgroups are not available on the host, not using them.
I: Distribution is jammy.
I: Current time: Mon Feb 21 01:54:36 MST 2022
I: pbuilder-time-stamp: 1645433676
I: Building the build environment
I: running debootstrap
/usr/sbin/debootstrap
E: /var/cache/pbuilder/aptcache/: No such directory
E: debootstrap failed
E: debootstrap.log not present
W: Aborting with an error
`````

Let's try turning caching off entirely, as per the
[man-page](https://manpages.debian.org/testing/pbuilder/pbuilderrc.5.en.html#FORMAT).

`````text
# NOT RUN
sed -i 's/^(APTCACHE=).*$/""/' ~/.pbuilderrc
sudo sed -i 's/^(APTCACHE=).*$/""/' /root/.pbuilderrc
# NOT RUN
`````

Wow... that worked. What sadness for my time.